In [1]:
import pandas as pd
df=pd.read_csv('stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [6]:
df.iloc[:,0::2]  # finding the odd columns

  tickers  revenue         people
0   GOOGL       87     larry page
1     WMT      484           n.a.
2    MSFT       85     bill gates
3    RIL        50  mukesh ambani
4    TATA       -1     ratan tata

df.iloc[:,1:5] 
# : signifies all rows and 1:5 means 1st column i,e,eps as it starts from 0 and it will go till 4th column. 5 will not consider

In [13]:
df.iloc[1:,0::2]

  tickers  revenue         people
1     WMT      484           n.a.
2    MSFT       85     bill gates
3    RIL        50  mukesh ambani
4    TATA       -1     ratan tata

# [1:,0::2] here 1: signifies starts with 1st index row to all the rows. 0::2 means starts with 0th column and step up 2 columns i.e. 1st column, 3rd column and so on

# Skiprows function to deleted unwanted rows from a file

In [26]:
data=pd.read_csv('stock_data_copy.csv',skiprows=1)
data

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Header function works same , mention from where the header starts

In [28]:
data=pd.read_csv('stock_data_copy.csv',header=1)
data

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# Suppose no header is there in the file, use header=none

In [30]:
data=pd.read_csv('stock_data_withoutheader.csv',header=None)
data

       0              1    2     3              4
0  GOOGL          27.82   87   845     larry page
1    WMT           4.61  484    65           n.a.
2   MSFT             -1   85    64     bill gates
3   RIL   not available   50  1023  mukesh ambani
4   TATA            5.6   -1  n.a.     ratan tata

# Column names can be written with the help of names

In [32]:
data=pd.read_csv('stock_data_withoutheader.csv',header=None,names=['company','eps','revenue','price','owner'])
data

  company            eps  revenue price          owner
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [35]:
df.head(3)

  tickers    eps  revenue price      people
0   GOOGL  27.82       87   845  larry page
1     WMT   4.61      484    65        n.a.
2    MSFT     -1       85    64  bill gates

In [36]:
df.isna().any()

tickers    False
eps        False
revenue    False
price      False
people     False
dtype: bool

# To remove all n.a. and other string values use na_values

In [38]:
df=pd.read_csv('stock_data.csv',na_values=['n.a.','not available'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [39]:
df.isna().any()

tickers    False
eps         True
revenue    False
price       True
people      True
dtype: bool

# revenue can't be -1, so we need to make that NaN.
# Dictionary passed with specific keys and values

In [44]:
df=pd.read_csv('stock_data.csv',na_values={'revenue':-1,'tickers':['n.a.','not available'],
                                          'eps':['n.a.','not available'],
                                          'people':['n.a.','not available'],
                                          'price':['n.a.','not available']}) # Dictionary passed with specific key and value
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [46]:
df.to_csv('new_csv',index=False)
print('Downloaded')

Downloaded

In [47]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [49]:
df1=df.iloc[:,0:2]
df1

  tickers    eps
0   GOOGL  27.82
1     WMT   4.61
2    MSFT  -1.00
3    RIL     NaN
4    TATA   5.60

In [50]:
df1.to_csv('new_cols',index=False)
print('downloaded')

downloaded